app/Controllers/admin/Dashboard.php

    public function index()
    {
        $data = [
            'title' => 'Dashboard',
            'produk' => model('produkModel')->countAll(),
            // 'konsumen' => model('konsumenModel')->countAll(),
            // 'pesanan' => model('pesananModel')->countAll(),
            'konsumen' => number_format('109'),
            'pesanan' => number_format('1900'),
        ];
---
SELECT COUNT(*) AS `numrows` FROM `pesanan`
SELECT COUNT(*) AS `numrows` FROM `konsumen`
SELECT COUNT(*) AS `numrows` FROM `produk`