app/Controllers/admin/Kriteria.php

    public function index()
    {
        helper('form');
        $data = [
            'title' => 'Kriteria',
            'jenis' => $this->jenisModel->findAll(),
        ];
---
SELECT *
FROM `jenis`

    public function create()
    {
        if ($this->request->isAjax()) {
            $data = $this->request->getVar();
            $this->kriteriaModel->save($data);
---
INSERT INTO `kriteria` (`fkJenis`, `nama`) VALUES ('1', 'aaa')