app/Controllers/admin/Pesanan.php

    public function get_data()
    {
        if ($this->request->isAJAX()) {
            $data = [
                'pesanan' => $this->pesananModel->joinKonsumenProduk()->find(),
            ];
---
SELECT `konsumen`.*, `produk`.*, `tanggal`, `status`, `pesanan`.`id` as `id`, `jenis`.`nama` as `jenis`
FROM `pesanan`
JOIN `konsumen` ON `konsumen`.`id` = `fkKonsumen`
JOIN `produk` ON `produk`.`id` = `fkProduk`
JOIN `jenis` ON `jenis`.`id` = `produk`.`fkJenis`

    public function invoice()
    {
        if ($this->request->isAjax()) {
            $id = $this->request->getVar('id');
            $data = [
                'pesanan' => $this->pesananModel->joinKonsumenProduk()->find($id)
            ];
---
SELECT `konsumen`.*, `produk`.*, `tanggal`, `status`, `pesanan`.`id` as `id`, `jenis`.`nama` as `jenis`
FROM `pesanan`
JOIN `konsumen` ON `konsumen`.`id` = `fkKonsumen`
JOIN `produk` ON `produk`.`id` = `fkProduk`
JOIN `jenis` ON `jenis`.`id` = `produk`.`fkJenis`
WHERE `pesanan`.`id` = '1'

    public function verifikasi()
    {
        if ($this->request->isAjax()) {
            $id = $this->request->getVar('id');
            $status = $this->request->getVar('status');
            $data = [
                'id' => $id,
                'status' => $status
            ];
            $this->pesananModel->save($data);
---
UPDATE `pesanan` SET `status` = 'dikirim'
WHERE `pesanan`.`id` IN ('1')