app/Controllers/Home.php

SELECT *
FROM `jenis`
SELECT `produk`.`id` as `id`, `merek`, `model`, `harga`, `jenis`.`nama` as `jenis`
FROM `produk`
JOIN `jenis` ON `fkJenis` = `jenis`.`id`
ORDER BY RAND()
 LIMIT 9
---
    public function index()
    {
        helper('form');

        $data = [
            'kriteria' => $this->kriteriaModel->findAll(),
            'jenis' => $this->jenisModel->findAll(),
            'produk' => $this->produkModel->join('jenis', 'fkJenis = jenis.id')->orderBy('RAND()')->select('produk.id as id,merek,model,harga,jenis.nama as jenis')->limit(9)->find(),

SELECT *
FROM `produk`
JOIN `fitur` ON `fkProduk` = `produk`.`id`
JOIN `kriteria` ON `fkKriteria` = `kriteria`.`id`
WHERE `fkProduk` = '39'
---
    public function produk($id)
    {
        helper('form');

        $data = [
            'produk' => $this->produkModel->join('jenis', 'fkJenis = jenis.id')->find($id),
            'fitur' => $this->produkModel->join('fitur', 'fkProduk = produk.id')->join('kriteria', 'fkKriteria = kriteria.id')->where('fkProduk', $id)->find(),

SELECT *
FROM `kriteria`
WHERE `fkJenis` = '3'
---
    public function get_data()
    {
        if ($this->request->isAjax()) {
            $id = $this->request->getVar('id');
            $data = [
                'kriteria' => $this->kriteriaModel->where('fkJenis', $id)->find(),
            ];

SELECT *
FROM `pesanan`
JOIN `produk` ON `fkProduk` = `produk`.`id`
WHERE `pesanan`.`id` = '1'
---
    public function pembayaran($id)
    {
        helper('form');
        $data['idPesanan'] = $id;
        $data['total'] = $this->pesananModel->join('produk', 'fkProduk = produk.id')->find($id)['harga'];

SELECT *
FROM `kriteria`
WHERE `fkJenis` = '3'
---
    public function smart()
    {
        //data alternatif
        $inputJenis = $this->request->getVar('jenis'); //jenis produk
        $kriteria = $this->kriteriaModel->where('fkJenis', $inputJenis)->find(); //kriteria