app/Models/KriteriaModel.php

    public function kriteriaJenis($jenis)
    {
        return $this->table('kriteria')
                    ->join('jenis','jenis.id = fkJenis')
                    ->select('kriteria.id,kriteria.nama,bobot,jenis.nama as jenis')
                    ->where('jenis.nama',$jenis)
                    ->find();
---
SELECT `kriteria`.`id`, `kriteria`.`nama`, `bobot`, `jenis`.`nama` as `jenis`
FROM `kriteria`
JOIN `jenis` ON `jenis`.`id` = `fkJenis`
WHERE `jenis`.`nama` = 'Kulkas'